## Feature Engineering - Handling Categorical Features - Day 4

Ordinal Encoding technique is used where the values have ranks 

For Example -->
 1. Grading System
 2. Experience of a batsman
 3. Weekdays and Weekends

In [1]:
import datetime

In [2]:
today_date = datetime.datetime.today()

In [3]:
today_date

datetime.datetime(2025, 4, 8, 18, 45, 51, 293217)

In [4]:
today_date - datetime.timedelta(1)

datetime.datetime(2025, 4, 7, 18, 45, 51, 293217)

In [5]:
today_date - datetime.timedelta(2)

datetime.datetime(2025, 4, 6, 18, 45, 51, 293217)

In [6]:
### list comprehension
days = [today_date-datetime.timedelta(x) for x in range(0,15)]

In [7]:
import pandas as pd
data = pd.DataFrame(days)
data.columns=["Day"]

In [8]:
data.head()

                         Day
0 2025-04-08 18:45:51.293217
1 2025-04-07 18:45:51.293217
2 2025-04-06 18:45:51.293217
3 2025-04-05 18:45:51.293217
4 2025-04-04 18:45:51.293217

In [9]:
data.dtypes

Day    datetime64[ns]
dtype: object

In [10]:
data['Day'].dt.weekday

0     1
1     0
2     6
3     5
4     4
5     3
6     2
7     1
8     0
9     6
10    5
11    4
12    3
13    2
14    1
Name: Day, dtype: int32

In [11]:
data['weekday_no'] = data['Day'].dt.weekday

In [12]:
data

                          Day  weekday_no
0  2025-04-08 18:45:51.293217           1
1  2025-04-07 18:45:51.293217           0
2  2025-04-06 18:45:51.293217           6
3  2025-04-05 18:45:51.293217           5
4  2025-04-04 18:45:51.293217           4
5  2025-04-03 18:45:51.293217           3
6  2025-04-02 18:45:51.293217           2
7  2025-04-01 18:45:51.293217           1
8  2025-03-31 18:45:51.293217           0
9  2025-03-30 18:45:51.293217           6
10 2025-03-29 18:45:51.293217           5
11 2025-03-28 18:45:51.293217           4
12 2025-03-27 18:45:51.293217           3
13 2025-03-26 18:45:51.293217           2
14 2025-03-25 18:45:51.293217           1

In [13]:
data['Day'].dt.strftime("%A")

0       Tuesday
1        Monday
2        Sunday
3      Saturday
4        Friday
5      Thursday
6     Wednesday
7       Tuesday
8        Monday
9        Sunday
10     Saturday
11       Friday
12     Thursday
13    Wednesday
14      Tuesday
Name: Day, dtype: object

In [14]:
data['weekday'] = data['Day'].dt.strftime("%A")

In [15]:
data

                          Day  weekday_no    weekday
0  2025-04-08 18:45:51.293217           1    Tuesday
1  2025-04-07 18:45:51.293217           0     Monday
2  2025-04-06 18:45:51.293217           6     Sunday
3  2025-04-05 18:45:51.293217           5   Saturday
4  2025-04-04 18:45:51.293217           4     Friday
5  2025-04-03 18:45:51.293217           3   Thursday
6  2025-04-02 18:45:51.293217           2  Wednesday
7  2025-04-01 18:45:51.293217           1    Tuesday
8  2025-03-31 18:45:51.293217           0     Monday
9  2025-03-30 18:45:51.293217           6     Sunday
10 2025-03-29 18:45:51.293217           5   Saturday
11 2025-03-28 18:45:51.293217           4     Friday
12 2025-03-27 18:45:51.293217           3   Thursday
13 2025-03-26 18:45:51.293217           2  Wednesday
14 2025-03-25 18:45:51.293217           1    Tuesday

In [16]:
dictionary = {
    'Monday':1,
    'Tuesday':2,
    'Wednesday':3,
    'Thursday':4,
    'Friday':5,
    'Saturday':6,
    'Sunday':7
}

In [17]:
dictionary

{'Monday': 1,
 'Tuesday': 2,
 'Wednesday': 3,
 'Thursday': 4,
 'Friday': 5,
 'Saturday': 6,
 'Sunday': 7}

In [18]:
data['weekday'].map(dictionary)

0     2
1     1
2     7
3     6
4     5
5     4
6     3
7     2
8     1
9     7
10    6
11    5
12    4
13    3
14    2
Name: weekday, dtype: int64

In [19]:
data['weekday_ordinal'] = data['weekday'].map(dictionary)

In [20]:
data

                          Day  weekday_no    weekday  weekday_ordinal
0  2025-04-08 18:45:51.293217           1    Tuesday                2
1  2025-04-07 18:45:51.293217           0     Monday                1
2  2025-04-06 18:45:51.293217           6     Sunday                7
3  2025-04-05 18:45:51.293217           5   Saturday                6
4  2025-04-04 18:45:51.293217           4     Friday                5
5  2025-04-03 18:45:51.293217           3   Thursday                4
6  2025-04-02 18:45:51.293217           2  Wednesday                3
7  2025-04-01 18:45:51.293217           1    Tuesday                2
8  2025-03-31 18:45:51.293217           0     Monday                1
9  2025-03-30 18:45:51.293217           6     Sunday                7
10 2025-03-29 18:45:51.293217           5   Saturday                6
11 2025-03-28 18:45:51.293217           4     Friday                5
12 2025-03-27 18:45:51.293217           3   Thursday                4
13 2025-03-26 18:45:51.293217           2  Wednesday                3
14 2025-03-25 18:45:51.293217           1    Tuesday                2

### Count or Frequency Encoding

In [21]:
train_set = pd.read_csv('http://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data' , header = None,index_col=None)
train_set.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [22]:
train_set.shape

(32561, 15)

In [24]:
train_set[1].unique()

array([' State-gov', ' Self-emp-not-inc', ' Private', ' Federal-gov',
       ' Local-gov', ' ?', ' Self-emp-inc', ' Without-pay',
       ' Never-worked'], dtype=object)

In [25]:
train_set[1].nunique()

9

In [26]:
columns = [1,3,5,6,7,8,9,13]

In [27]:
train_set[columns]

,1,3,5,6,7,8,9,13
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,United-States
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,United-States
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,United-States
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,United-States
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,Cuba
...,...,...,...,...,...,...,...,...
32556,Private,Assoc-acdm,Married-civ-spouse,Tech-support,Wife,White,Female,United-States
32557,Private,HS-grad,Married-civ-spouse,Machine-op-inspct,Husband,White,Male,United-States
32558,Private,HS-grad,Widowed,Adm-clerical,Unmarried,White,Female,United-States
32559,Private,HS-grad,Never-married,Adm-clerical,Own-child,White,Male,United-States
32560,Self-emp-inc,HS-grad,Married-civ-spouse,Exec-managerial,Wife,White,Female,United-States

In [28]:
train_set = train_set[columns]

In [29]:
train_set.columns = ['Employment','Degree','Status','Destination','family_job','Race','Sex','Country']

In [30]:
train_set.head()

,Employment,Degree,Status,Destination,family_job,Race,Sex,Country
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,United-States
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,United-States
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,United-States
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,United-States
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,Cuba

In [31]:
for feature in train_set.columns[:]:
    print(feature,":",train_set[feature].nunique(),"labels")

Employment : 9 labels
Degree : 16 labels
Status : 7 labels
Destination : 15 labels
family_job : 6 labels
Race : 5 labels
Sex : 2 labels
Country : 42 labels

In [33]:
train_set['Country'].value_counts().to_dict()

{' United-States': 29170,
 ' Mexico': 643,
 ' ?': 583,
 ' Philippines': 198,
 ' Germany': 137,
 ' Canada': 121,
 ' Puerto-Rico': 114,
 ' El-Salvador': 106,
 ' India': 100,
 ' Cuba': 95,
 ' England': 90,
 ' Jamaica': 81,
 ' South': 80,
 ' China': 75,
 ' Italy': 73,
 ' Dominican-Republic': 70,
 ' Vietnam': 67,
 ' Guatemala': 64,
 ' Japan': 62,
 ' Poland': 60,
 ' Columbia': 59,
 ' Taiwan': 51,
 ' Haiti': 44,
 ' Iran': 43,
 ' Portugal': 37,
 ' Nicaragua': 34,
 ' Peru': 31,
 ' France': 29,
 ' Greece': 29,
 ' Ecuador': 28,
 ' Ireland': 24,
 ' Hong': 20,
 ' Cambodia': 19,
 ' Trinadad&Tobago': 19,
 ' Laos': 18,
 ' Thailand': 18,
 ' Yugoslavia': 16,
 ' Outlying-US(Guam-USVI-etc)': 14,
 ' Honduras': 13,
 ' Hungary': 13,
 ' Scotland': 12,
 ' Holand-Netherlands': 1}

In [34]:
country_map = train_set['Country'].value_counts().to_dict()

In [35]:
train_set['Country'] = train_set['Country'].map(country_map)

In [36]:
train_set

,Employment,Degree,Status,Destination,family_job,Race,Sex,Country
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,29170
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,29170
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,29170
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,29170
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,95
...,...,...,...,...,...,...,...,...
32556,Private,Assoc-acdm,Married-civ-spouse,Tech-support,Wife,White,Female,29170
32557,Private,HS-grad,Married-civ-spouse,Machine-op-inspct,Husband,White,Male,29170
32558,Private,HS-grad,Widowed,Adm-clerical,Unmarried,White,Female,29170
32559,Private,HS-grad,Never-married,Adm-clerical,Own-child,White,Male,29170
32560,Self-emp-inc,HS-grad,Married-civ-spouse,Exec-managerial,Wife,White,Female,29170

##### Above is example of frequency encoding....

#### Advantages
1. Easy to Use
2. Not increasing feature space 

#### Disadvantages
1. It will provide same weight if the frequencies are same

### Target Guided Ordinal Encoding
1. Ordering the labels according to the target
2. Replace the labels by the joint probability of being 1 or 0

In [39]:
import pandas as pd 
df = pd.read_csv("Datasets/titanic.csv",usecols=['Cabin','Survived'])
df.head()

   Survived Cabin
0         0   NaN
1         1   C85
2         1   NaN
3         1  C123
4         0   NaN

In [40]:
df['Cabin'].fillna("Missing",inplace=True)

In [41]:
df.head(20)

    Survived    Cabin
0          0  Missing
1          1      C85
2          1  Missing
3          1     C123
4          0  Missing
5          0  Missing
6          0      E46
7          0  Missing
8          1  Missing
9          1  Missing
10         1       G6
11         1     C103
12         0  Missing
13         0  Missing
14         0  Missing
15         1  Missing
16         0  Missing
17         1  Missing
18         0  Missing
19         1  Missing

In [43]:
df['Cabin'] = df['Cabin'].astype(str).str[0]

In [44]:
df

     Survived Cabin
0           0     M
1           1     C
2           1     M
3           1     C
4           0     M
..        ...   ...
886         0     M
887         1     B
888         0     M
889         1     C
890         0     M

[891 rows x 2 columns]

In [45]:
df['Cabin'].unique()

array(['M', 'C', 'E', 'G', 'D', 'A', 'B', 'F', 'T'], dtype=object)

In [46]:
df.groupby(['Cabin'])['Survived'].mean()

Cabin
A    0.466667
B    0.744681
C    0.593220
D    0.757576
E    0.750000
F    0.615385
G    0.500000
M    0.299854
T    0.000000
Name: Survived, dtype: float64

In [47]:
df.groupby(['Cabin'])['Survived'].sum()

Cabin
A      7
B     35
C     35
D     25
E     24
F      8
G      2
M    206
T      0
Name: Survived, dtype: int64

In [48]:
df.groupby(['Cabin'])['Survived'].mean().sort_values()

Cabin
T    0.000000
M    0.299854
A    0.466667
G    0.500000
C    0.593220
F    0.615385
B    0.744681
E    0.750000
D    0.757576
Name: Survived, dtype: float64

In [49]:
df.groupby(['Cabin'])['Survived'].mean().sort_values().index

Index(['T', 'M', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin')

In [50]:
ordinal_labels = df.groupby(['Cabin'])['Survived'].mean().sort_values().index
ordinal_labels

Index(['T', 'M', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin')

In [51]:
ordinal_labels2 = {k:i for i,k in enumerate(ordinal_labels,0)}

In [52]:
ordinal_labels2

{'T': 0, 'M': 1, 'A': 2, 'G': 3, 'C': 4, 'F': 5, 'B': 6, 'E': 7, 'D': 8}

In [53]:
df['Cabin_ordinal_lables'] = df['Cabin'].map(ordinal_labels2)

In [54]:
df.head()

   Survived Cabin  Cabin_ordinal_lables
0         0     M                     1
1         1     C                     4
2         1     M                     1
3         1     C                     4
4         0     M                     1

### Mean Encoding

In [57]:
mean_ordinal = df.groupby(['Cabin'])['Survived'].mean().to_dict()

In [58]:
mean_ordinal

{'A': 0.4666666666666667,
 'B': 0.7446808510638298,
 'C': 0.5932203389830508,
 'D': 0.7575757575757576,
 'E': 0.75,
 'F': 0.6153846153846154,
 'G': 0.5,
 'M': 0.29985443959243085,
 'T': 0.0}

In [59]:
df['Cabin_mean_ordinal_encode'] = df['Cabin'].map(mean_ordinal)

In [60]:
df.head()

   Survived Cabin  Cabin_ordinal_lables  Cabin_mean_ordinal_encode
0         0     M                     1                   0.299854
1         1     C                     4                   0.593220
2         1     M                     1                   0.299854
3         1     C                     4                   0.593220
4         0     M                     1                   0.299854

#### Advantages
1. It captures information within the labels
2. Creates a good relationship between labels and target

#### Disadvantages
1. It is prone to overfitting.

### Probability Ratio Encoding- Handling Categorical Feature

1. Probability of Survived based on Cabin -- Categorical Feature
2. Probability of Not Survived -- 1 - prob(Survived)
3. Prob(Survivied)/Prob(Not Survived)
4. Dictionary to map cabin with probability
5. Replace with the categorical feature

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("Datasets/titanic.csv",usecols = ['Cabin','Survived'])

In [3]:
df.head()

   Survived Cabin
0         0   NaN
1         1   C85
2         1   NaN
3         1  C123
4         0   NaN

In [4]:
## Replacing
df['Cabin'].fillna("Missing",inplace=True)

In [5]:
df.sample(6)

     Survived    Cabin
303         1     E101
657         0  Missing
692         1  Missing
113         0  Missing
350         0  Missing
618         1       F4

In [6]:
df['Cabin'].unique()

array(['Missing', 'C85', 'C123', 'E46', 'G6', 'C103', 'D56', 'A6',
       'C23 C25 C27', 'B78', 'D33', 'B30', 'C52', 'B28', 'C83', 'F33',
       'F G73', 'E31', 'A5', 'D10 D12', 'D26', 'C110', 'B58 B60', 'E101',
       'F E69', 'D47', 'B86', 'F2', 'C2', 'E33', 'B19', 'A7', 'C49', 'F4',
       'A32', 'B4', 'B80', 'A31', 'D36', 'D15', 'C93', 'C78', 'D35',
       'C87', 'B77', 'E67', 'B94', 'C125', 'C99', 'C118', 'D7', 'A19',
       'B49', 'D', 'C22 C26', 'C106', 'C65', 'E36', 'C54',
       'B57 B59 B63 B66', 'C7', 'E34', 'C32', 'B18', 'C124', 'C91', 'E40',
       'T', 'C128', 'D37', 'B35', 'E50', 'C82', 'B96 B98', 'E10', 'E44',
       'A34', 'C104', 'C111', 'C92', 'E38', 'D21', 'E12', 'E63', 'A14',
       'B37', 'C30', 'D20', 'B79', 'E25', 'D46', 'B73', 'C95', 'B38',
       'B39', 'B22', 'C86', 'C70', 'A16', 'C101', 'C68', 'A10', 'E68',
       'B41', 'A20', 'D19', 'D50', 'D9', 'A23', 'B50', 'A26', 'D48',
       'E58', 'C126', 'B71', 'B51 B53 B55', 'D49', 'B5', 'B20', 'F G63',
       'C62 C64', 'E24', 'C90', 'C45', 'E8', 'B101', 'D45', 'C46', 'D30',
       'E121', 'D11', 'E77', 'F38', 'B3', 'D6', 'B82 B84', 'D17', 'A36',
       'B102', 'B69', 'E49', 'C47', 'D28', 'E17', 'A24', 'C50', 'B42',
       'C148'], dtype=object)

In [7]:
df['Cabin'].nunique()

148

In [8]:
df['Cabin'] = df['Cabin'].astype(str).str[0]

In [10]:
df.sample(5)

     Survived Cabin
489         1     M
237         1     M
478         0     M
726         1     M
52          1     D

In [11]:
df['Cabin'].unique()

array(['M', 'C', 'E', 'G', 'D', 'A', 'B', 'F', 'T'], dtype=object)

In [13]:
prob_df = df.groupby(['Cabin'])['Survived'].mean()

In [14]:
prob_df

Cabin
A    0.466667
B    0.744681
C    0.593220
D    0.757576
E    0.750000
F    0.615385
G    0.500000
M    0.299854
T    0.000000
Name: Survived, dtype: float64

In [15]:
prob_df = pd.DataFrame(prob_df)

In [16]:
prob_df

       Survived
Cabin
A      0.466667
B      0.744681
C      0.593220
D      0.757576
E      0.750000
F      0.615385
G      0.500000
M      0.299854
T      0.000000

In [17]:
prob_df['Died'] = 1 - prob_df['Survived']

In [18]:
prob_df

       Survived      Died
Cabin
A      0.466667  0.533333
B      0.744681  0.255319
C      0.593220  0.406780
D      0.757576  0.242424
E      0.750000  0.250000
F      0.615385  0.384615
G      0.500000  0.500000
M      0.299854  0.700146
T      0.000000  1.000000

In [19]:
prob_df['Survived'] + prob_df['Died']

Cabin
A    1.0
B    1.0
C    1.0
D    1.0
E    1.0
F    1.0
G    1.0
M    1.0
T    1.0
dtype: float64

In [20]:
prob_df['Probability_ratio'] = prob_df['Survived']/prob_df['Died']
prob_df.head(5)

       Survived      Died  Probability_ratio
Cabin
A      0.466667  0.533333           0.875000
B      0.744681  0.255319           2.916667
C      0.593220  0.406780           1.458333
D      0.757576  0.242424           3.125000
E      0.750000  0.250000           3.000000

In [22]:
probability_encoded = prob_df['Probability_ratio'].to_dict()

In [23]:
df['Cabin_encoded'] = df['Cabin'].map(probability_encoded)
df.head()

   Survived Cabin  Cabin_encoded
0         0     M       0.428274
1         1     C       1.458333
2         1     M       0.428274
3         1     C       1.458333
4         0     M       0.428274